#+PROPERTY: header-args:python :session bifur :tangle app.py :comment link 
#+LATEX_HEADER: \usemintedstyle{tango}%colorful
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \definecolor{bg}{rgb}{0.9,0.9,0.9}
#+LATEX_HEADER: \setminted{linenos=True,bgcolor=bg}
#+LATEX_HEADER: \usepackage[bottom=0.5in,margin=1in]{geometry}
#+BEGIN_SRC python
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
from scipy.integrate import odeint
from scipy.interpolate import splprep, splev
from io import BytesIO
import streamlit as st
from PIL import Image
import time
#+END_SRC 

#+RESULTS:
Setup: https://towardsdatascience.com/quickly-build-and-deploy-an-application-with-streamlit-988ca08c7e83
Following cite:2001_JTB_Tyson_Antagonism_Hysteresis_Irreversible
